stevenj/avr-libc3/include/avr/io/atmega8535.h
/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_MCUCSR    _SFR_MEM8 (0x0054) /* MCU Control And Status Register */
#define EXINT_MCUCR     _SFR_MEM8 (0x0055) /* General Interrupt Control Register */
#define EXINT_GIFR      _SFR_MEM8 (0x005A) /* General Interrupt Flag Register */
#define EXINT_GICR      _SFR_MEM8 (0x005B) /* General Interrupt Control Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR       _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_SFIOR       _SFR_MEM8 (0x0050) /* Special Function IO Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0051) /* Oscillator Calibration Value */
#define CPU_MCUCSR      _SFR_MEM8 (0x0054) /* MCU Control And Status Register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPMCR       _SFR_MEM8 (0x0057) 
#define CPU_SP          _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt 1 */
#define None_TIMER2_COMP_vect_num  (3)                 
#define None_TIMER2_COMP_vect      _VECTOR(3)          /* Timer/Counter2 Compare Match */
#define None_TIMER2_OVF_vect_num   (4)                 
#define None_TIMER2_OVF_vect       _VECTOR(4)          /* Timer/Counter2 Overflow */
#define None_TIMER1_CAPT_vect_num  (5)                 
#define None_TIMER1_CAPT_vect      _VECTOR(5)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (6)                 
#define None_TIMER1_COMPA_vect     _VECTOR(6)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (7)                 
#define None_TIMER1_COMPB_vect     _VECTOR(7)          /* Timer/Counter1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (8)                 
#define None_TIMER1_OVF_vect       _VECTOR(8)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num   (9)                 
#define None_TIMER0_OVF_vect       _VECTOR(9)          /* Timer/Counter0 Overflow */
#define None_SPI_STC_vect_num      (10)                
#define None_SPI_STC_vect          _VECTOR(10)         /* SPI Serial Transfer Complete */
#define None_USART_RX_vect_num     (11)                
#define None_USART_RX_vect         _VECTOR(11)         /* USART, RX Complete */
#define None_USART_UDRE_vect_num   (12)                
#define None_USART_UDRE_vect       _VECTOR(12)         /* USART Data Register Empty */
#define None_USART_TX_vect_num     (13)                
#define None_USART_TX_vect         _VECTOR(13)         /* USART, TX Complete */
#define None_ADC_vect_num          (14)                
#define None_ADC_vect              _VECTOR(14)         /* ADC Conversion Complete */
#define None_EE_RDY_vect_num       (15)                
#define None_EE_RDY_vect           _VECTOR(15)         /* EEPROM Ready */
#define None_ANA_COMP_vect_num     (16)                
#define None_ANA_COMP_vect         _VECTOR(16)         /* Analog Comparator */
#define None_TWI_vect_num          (17)                
#define None_TWI_vect              _VECTOR(17)         /* Two-wire Serial Interface */
#define None_INT2_vect_num         (18)                
#define None_INT2_vect             _VECTOR(18)         /* External Interrupt Request 2 */
#define None_TIMER0_COMP_vect_num  (19)                
#define None_TIMER0_COMP_vect      _VECTOR(19)         /* TimerCounter0 Compare Match */
#define None_SPM_RDY_vect_num      (20)                
#define None_SPM_RDY_vect          _VECTOR(20)         /* Store Program Memory Read */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (21 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START            (0x0000)                                         
#define PROGMEM_SIZE             (0x2000)                                         
#define PROGMEM_END              (PROGMEM_START + PROGMEM_SIZE - 1)               

#define FLASH_START              (0x0000)                                         
#define FLASH_SIZE               (0x2000)                                         
#define FLASH_PAGE_SIZE          (0x0040)                                         
#define FLASH_END                (FLASH_START + FLASH_SIZE - 1)                   

#define BOOT_SECTION_1_START     (0x1F00)                                         
#define BOOT_SECTION_1_SIZE      (0x0100)                                         
#define BOOT_SECTION_1_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_1_END       (BOOT_SECTION_1_START + BOOT_SECTION_1_SIZE - 1) 

#define BOOT_SECTION_2_START     (0x1E00)                                         
#define BOOT_SECTION_2_SIZE      (0x0200)                                         
#define BOOT_SECTION_2_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_2_END       (BOOT_SECTION_2_START + BOOT_SECTION_2_SIZE - 1) 

#define BOOT_SECTION_3_START     (0x1C00)                                         
#define BOOT_SECTION_3_SIZE      (0x0400)                                         
#define BOOT_SECTION_3_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_3_END       (BOOT_SECTION_3_START + BOOT_SECTION_3_SIZE - 1) 

#define BOOT_SECTION_4_START     (0x1800)                                         
#define BOOT_SECTION_4_SIZE      (0x0800)                                         
#define BOOT_SECTION_4_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_4_END       (BOOT_SECTION_4_START + BOOT_SECTION_4_SIZE - 1) 

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0002)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

